tap "beeftornado/rmtree"
tap "coursier/formulas"
tap "dart-lang/dart"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "mongodb/brew"
tap "sass/sass"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Modern replacement for 'ls'
brew "exa"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# Simple terminal UI for git commands
brew "lazygit"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Rust toolchain installer
brew "rustup-init"
# Cross-shell prompt for astronauts
brew "starship"
# Terminal multiplexer
brew "tmux"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Launcher for Coursier
brew "coursier/formulas/coursier"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Stylesheet Preprocessor
brew "sass/sass/sass"
# GPU-accelerated terminal emulator
cask "alacritty"
# Open-source code editor
cask "visual-studio-code"
